content/posts/Fibration_symmetries_uncover_the_building_blocks_of_biological_networks_by_Flaviano_Morone_and_Hernan_Makse_in_2020.md
+++
title = "Fibration symmetries uncover the building blocks of biological networks by Flaviano Morone and Hernan Makse in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:27-04:00
slug = "Fibration_symmetries_uncover_the_building_blocks_of_biological_networks_by_Flaviano_Morone_and_Hernan_Makse_in_2020"
draft = false
+++

## [systems biology]({{< relref "systems_biology" >}}), [papers]({{< relref "papers" >}}) {#systems-biology--systems-biology-dot-md--papers--papers-dot-md}


## I. Results {#i-dot-results}


### A. Input tree representation {#a-dot-input-tree-representation}


### B. Symmetry fibration of a network {#b-dot-symmetry-fibration-of-a-network}


### C. Symmetry fibration leads to synchronization {#c-dot-symmetry-fibration-leads-to-synchronization}


### D. Strongly connected components of the E. coli network E. Fiber building blocks {#d-dot-strongly-connected-components-of-the-e-dot-coli-network-e-dot-fiber-building-blocks}


### F. Fibonacci fibers {#f-dot-fibonacci-fibers}


### G. Multi-layer composite fibers 10 {#g-dot-multi-layer-composite-fibers-10}


### H. Fibration landscape across biological networks, species and system domains {#h-dot-fibration-landscape-across-biological-networks-species-and-system-domains}


### I. Gene co-expression and synchronization via symmetry fibration {#i-dot-gene-co-expression-and-synchronization-via-symmetry-fibration}


## II. Discussion {#ii-dot-discussion}


## III. transcriptional regulatory network of <span class="underline"><span class="underline">E. coli</span></span> {#iii-dot-transcriptional-regulatory-network-of}


## IV. Symmetry fibrations {#iv-dot-symmetry-fibrations}


### A. Input tree {#a-dot-input-tree}


### B. Isomorphic input trees {#b-dot-isomorphic-input-trees}


### C. From fibrations to symmetry fibrations via isomorphic input trees and minimal bases {#c-dot-from-fibrations-to-symmetry-fibrations-via-isomorphic-input-trees-and-minimal-bases}


## V. Algorithm to find fibers with minimal balance coloring {#v-dot-algorithm-to-find-fibers-with-minimal-balance-coloring}


## VI. Strongly connected component {#vi-dot-strongly-connected-component}


## VII. Statistics of fibers in the TRN of <span class="underline"><span class="underline">E. coli</span></span> {#vii-dot-statistics-of-fibers-in-the-trn-of}


### A. Fibers statistics in <span class="underline"><span class="underline">E. coli</span></span> {#a-dot-fibers-statistics-in}


### B. Full list of fibers in <span class="underline"><span class="underline">E. coli</span></span> {#b-dot-full-list-of-fibers-in}


## VIII. Datasets of biological and non-biological networks {#viii-dot-datasets-of-biological-and-non-biological-networks}
